docs/architecture/c4/mermaid/structurizr-AuthenticationServiceComponent.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["Component View: Authentication Service"]
    style diagram fill:#ffffff,stroke:#ffffff

    subgraph 3 ["Task Management"]
      style 3 fill:#ffffff,stroke:#005696,color:#005696

      subgraph 30 ["Authentication Service"]
        style 30 fill:#ffffff,stroke:#005696,color:#005696

        31("<div style='font-weight: bold'>Security Filter Chain</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring Security]</div><div style='font-size: 80%; margin-top:10px'>Security Filter Chain</div>")
        style 31 fill:#ffffff,stroke:#005696,color:#005696
        32("<div style='font-weight: bold'>Controller</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Controller</div>")
        style 32 fill:#ffffff,stroke:#005696,color:#005696
        33("<div style='font-weight: bold'>Service</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Service</div>")
        style 33 fill:#ffffff,stroke:#005696,color:#005696
        34("<div style='font-weight: bold'>Repository</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Repository</div>")
        style 34 fill:#ffffff,stroke:#005696,color:#005696
        35("<div style='font-weight: bold'>Scheduler</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Scheduler</div>")
        style 35 fill:#ffffff,stroke:#005696,color:#005696
        36("<div style='font-weight: bold'>Producer</div><div style='font-size: 70%; margin-top: 0px'>[Component: Spring]</div><div style='font-size: 80%; margin-top:10px'>Producer</div>")
        style 36 fill:#ffffff,stroke:#005696,color:#005696
      end

      5("<div style='font-weight: bold'>API Gateway</div><div style='font-size: 70%; margin-top: 0px'>[Container: Spring Cloud Gateway]</div><div style='font-size: 80%; margin-top:10px'>API Gateway</div>")
      style 5 fill:#ffffff,stroke:#005696,color:#005696
      58["<div style='font-weight: bold'>Message Broker</div><div style='font-size: 70%; margin-top: 0px'>[Container: RabbitMQ]</div><div style='font-size: 80%; margin-top:10px'>Message Broker</div>"]
      style 58 fill:#ffffff,stroke:#005696,color:#005696
      61[("<div style='font-weight: bold'>Authentication DB</div><div style='font-size: 70%; margin-top: 0px'>[Container: PostgreSQL]</div><div style='font-size: 80%; margin-top:10px'>RDBMS</div>")]
      style 61 fill:#ffffff,stroke:#005696,color:#005696
    end

    31-. "<div></div><div style='font-size: 70%'></div>" .->32
    32-. "<div></div><div style='font-size: 70%'></div>" .->33
    33-. "<div></div><div style='font-size: 70%'></div>" .->34
    35-. "<div></div><div style='font-size: 70%'></div>" .->34
    35-. "<div></div><div style='font-size: 70%'></div>" .->36
    5-. "<div>Forward</div><div style='font-size: 70%'></div>" .->31
    36-. "<div>Publish event</div><div style='font-size: 70%'></div>" .->58
    34-. "<div>Reads from and writes to</div><div style='font-size: 70%'>[JDBC]</div>" .->61

  end
